# Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

list = [5, 6, 0, 9, 1]

list.sort()
print(list[len(list)-1])
