# Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.

list1 = ["Задайте", "список", "Напишите", "программу", "которая", "определит", "присутствует", "45"]
number = 45
for i in list():
    if str(number) == i: print()
