# 3. Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество 
# вхождений одной строки в другой.

s = input('Введите первую строку: ')
s_1 = input('Введите вторую строку: ')

# if len(s) > len(s_1):
#     n = len(s_1)
# else:
#     n = len(s)


count = 0
for i in name1:
    for j in text:
        if i == j:
            count += 1
if count >=5 :
    print(count)
