# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех 
# значений предикат.
#  Булевская арифметика!
# ¬ -> не
# V -> или
# ⋀ -> и
x, y, x = "a", 2, 3.1
print(not (x or y or z) == (not x and not y and not z))

