# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:

# - 6782 -> 23
# - 0,56 -> 11
sum1 = 0
for i in "6782":
    sum += int(i)

print(sum("6782".split()))
